{"class_name": "Sequential", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Model", "config": {"output_layers": [["mixed10", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "filters": 32, "use_bias": false, "strides": [2, 2], "name": "conv2d_1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true, "dtype": "float32"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "filters": 32, "use_bias": false, "strides": [1, 1], "name": "conv2d_2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true, "dtype": "float32"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_3", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true, "dtype": "float32"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "filters": 80, "use_bias": false, "strides": [1, 1], "name": "conv2d_4", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true, "dtype": "float32"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "filters": 192, "use_bias": false, "strides": [1, 1], "name": "conv2d_5", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true, "dtype": "float32"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_9", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true, "dtype": "float32"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 48, "use_bias": false, "strides": [1, 1], "name": "conv2d_7", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [1, 1], "name": "conv2d_10", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true, "dtype": "float32"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true, "dtype": "float32"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "padding": "same", "name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_6", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [5, 5], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_8", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [1, 1], "name": "conv2d_11", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 32, "use_bias": false, "strides": [1, 1], "name": "conv2d_12", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true, "dtype": "float32"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true, "dtype": "float32"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true, "dtype": "float32"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true, "dtype": "float32"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed0", "trainable": true, "dtype": "float32"}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_16", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": true, "dtype": "float32"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 48, "use_bias": false, "strides": [1, 1], "name": "conv2d_14", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [1, 1], "name": "conv2d_17", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true, "dtype": "float32"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": true, "dtype": "float32"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "padding": "same", "name": "average_pooling2d_2", "strides": [1, 1], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_13", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [5, 5], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_15", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [1, 1], "name": "conv2d_18", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_19", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true, "dtype": "float32"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": true, "dtype": "float32"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": true, "dtype": "float32"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": true, "dtype": "float32"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed1", "trainable": true, "dtype": "float32"}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_23", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_23", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_23", "trainable": true, "dtype": "float32"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 48, "use_bias": false, "strides": [1, 1], "name": "conv2d_21", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [1, 1], "name": "conv2d_24", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_24", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_21", "trainable": true, "dtype": "float32"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_24", "trainable": true, "dtype": "float32"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "padding": "same", "name": "average_pooling2d_3", "strides": [1, 1], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_20", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [5, 5], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_22", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [1, 1], "name": "conv2d_25", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_26", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_25", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_26", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_20", "trainable": true, "dtype": "float32"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_22", "trainable": true, "dtype": "float32"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_25", "trainable": true, "dtype": "float32"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": true, "dtype": "float32"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed2", "trainable": true, "dtype": "float32"}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 64, "use_bias": false, "strides": [1, 1], "name": "conv2d_28", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_28", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": true, "dtype": "float32"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [1, 1], "name": "conv2d_29", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_29", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": true, "dtype": "float32"}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "filters": 384, "use_bias": false, "strides": [2, 2], "name": "conv2d_27", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "filters": 96, "use_bias": false, "strides": [2, 2], "name": "conv2d_30", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_27", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_30", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": true, "dtype": "float32"}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": true, "dtype": "float32"}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "mixed3", "trainable": true, "dtype": "float32"}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "filters": 128, "use_bias": false, "strides": [1, 1], "name": "conv2d_35", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "epsilon": 0.001, "scale": false, "trainable": true, "name": "batch_normalization_35", "moving_mean_initializer": {"class_name": "Zeros", 