{"class_name": "Sequential", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Model", "config": {"output_layers": [["block5_pool", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 64, "use_bias": true, "strides": [1, 1], "name": "block1_conv1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 64, "use_bias": true, "strides": [1, 1], "name": "block1_conv2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block1_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 128, "use_bias": true, "strides": [1, 1], "name": "block2_conv1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 128, "use_bias": true, "strides": [1, 1], "name": "block2_conv2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block2_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 256, "use_bias": true, "strides": [1, 1], "name": "block3_conv1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 256, "use_bias": true, "strides": [1, 1], "name": "block3_conv2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 256, "use_bias": true, "strides": [1, 1], "name": "block3_conv3", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 256, "use_bias": true, "strides": [1, 1], "name": "block3_conv4", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block3_conv4", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block3_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block4_conv1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block4_conv2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block4_conv3", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block4_conv4", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block4_conv4", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block4_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block5_conv1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block5_conv2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block5_conv3", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "filters": 512, "use_bias": true, "strides": [1, 1], "name": "block5_conv4", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "name": "block5_conv4", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "block5_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}], "name": "vgg19", "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": 123, "dtype": "float32", "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": 123, "dtype": "float32", "name": "dropout_2", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": 123, "dtype": "float32", "name": "dropout_3", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 1, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_4", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}